{"posts":[{"title":"LLaMA","text":"LLaMA: Open and Efficient Foundation Language Models 引言 参数量变大, 性能不一定更好, 数据量需要同样增大才行 数据 使用的全是公开数据 在 English CommonCrawl 数据集使用 fastText Linear classifier 进行筛选, 这个模型效率比较高 训了一个页面分类器区分是否是wikipedia的参考页面(参考页面相对质量比较高), 可以用来过滤低质量数据 对于github数据清洗, 根据数字和字母的比例来判断数据质量 tokenizer 使用的是 byte-pair encoding (BPE) 总共1.4T的tokens, 大多数数据在整个训练中只使用一次, 但Wikipedia和books使用了两次 模型结构 整体基于transformer, 改进如下 Pre-normalization 增加训练稳定性, 具体使用的是 RMSNorm SwiGLU activation function 把绝对位置编码换成 RoPE 效率优化 使用 causal multi-head attention 使用 checkpointing 的技术减少了显存占用, 但保留了计算量高的激活输出(activations) 训练 65B的模型 2048张A100 训21天 评测 在数据评测这部分, 测试了 maj1@k 这个操作, 有明显的涨点 指令微调 Intruction Finetuning 指令微调之后, 模型在MMLU上的指标进一步提高了","link":"/posts/20240731-llama/"},{"title":"博客平台选择","text":"wordpress/hexo/hugo的比较 动态博客 vs 静态博客 动态博客: 如wordpress, typecho等 优点(主要以wordpress为例): 上手简单, 安装可能更容易 功能全, 开箱即用: 有在线写作界面, 有网就能写 有后台管理界面, 可以可视化管理, 容易上手, 更专注创作 有评论系统 有阅读统计系统 有很多主题, 但很多wordpres主题不适合国内使用, 找主题比较折腾 缺点: 需要购买和配置服务器, 有些服务商会提供配置好的环境 需要管理大量插件, 插件太多可能引起性能问题 需要操心安全问题 相对于静态博客, 好看的主题比较少 使用动态博客你可能需要折腾的东西 找主题, 修改定制主题 找编辑器插件(如果你想使用markdown编辑) 安装各种插件, 安全插件, 公式插件等等 可能的硬伤(也许能通过其他方式来绕过): 在线编辑体验不够好, 比不上本地编辑器(如typora)的体验 曲线救国: 如 mark2press 这样的工具, 可以实现本地编辑然后发布到wordpress 同样是由于在线写作发布的问题, 文章不方便同时发布到其他平台 曲线救国: 使用如OpenWrite这样的多平台发布工具 静态博客: 如hexo, hugo等 优点(主要以hexo为例): 安全: 纯静态页面, 无后台管理页面, 基本不用考虑站点安全问题 数据完全自己掌握: 自己会很清楚文件是怎样保存的 成本低: 网上有很多方法实现零成本部署, 如 github page 等 最佳的本地编辑体验: 可以在本地使用自己喜欢的markdown编辑器, 可以拥有最佳的编辑体验 方便发布到多个平台 后期维护成本极低, 后期更省心. 缺点: 前期学习曲线稍高(因主题而定, 一些好用的出题还是很容易上手的) 比动态博客更加折腾, 想折腾好难度还比较高, 见下方 发布稍微麻烦, 需要在本地编辑好在通过一些方法部署到网络上, 但打通工作流后就可以一键部署 无法在线编辑(现在也有一些方法实现在线编辑) 使用静态博客你可能需要折腾的东西: 访问量统计 评论系统 搜索功能 发布流程 SEO 图床管理问题 性能优化 硬伤: 无明显硬伤, 主要是如果要添加丰富的功能会比较折腾 动态和静态博客如何选择? 可以从一定要有的点和不能忍受的缺点出发做选择 想低成本的使用 -&gt; 选静态, 网上有很多方法能实现0成本 担心安全问题 -&gt; 选静态 想对数据组织有非常高的管控程度/了解程度 -&gt; 选静态, 文件结构一目了然, 管理轻松 对编辑体验有极高需求 -&gt; 选静态, 可以使用本地编辑器 想在线编辑,管理 -&gt; 选动态 想开箱即用, 不想太折腾 -&gt; 选动态 动态博客想尝鲜的话, wordpress.com 甚至可以免费使用. hugo和hexo如何选择? 选择hexo是因为遇到了一个喜欢的主题. 感觉hexo更容易上手一些. 安装插件比较方便, 可以通过插件的方式来增加一些功能. hexo可能在文章过多的时候可能存在构建较慢的性能问题, 但网上已经看到了一些基于hexo发布了500篇以上的博客, 所以前期这个性能问题应该不太重要, 后面碰到再说. 附录: 我的博客折腾历程 (按照时间顺序从前到后排序) typecho hugo hola wordpress hexo (hexo和wordpress还在摇摆中) 最后, 内容才是一个博客最核心的东西, 请不要舍本逐末, 快速搭建好一个差不多的博客环境, 然后就持续输出吧!","link":"/posts/20240429_blog_platforms/"},{"title":"hexo markdown测试","text":"不同的文字格式 公式 行内公式 $f(x)=x^2+1$​ 行间引用 $$\\boldsymbol{\\mathcal{R}}_m^{\\top}\\boldsymbol{\\mathcal{R}}n=\\boldsymbol{\\mathcal{R}}{n-m}$$​​ 插入图片 source文件夹内结构如下 1234_posts/ example.mdimages/ a.jpg 以typora编辑器为例, 在example.md中引用图片a.jpg的方式是![](../images/a.jpg) 可以在typora设置中, 设置插入图片时 -&gt; 复制到指定文件夹, 设置文件夹路径为../images/ 以下为插入图片并缩放大小至50% 表格 列1 列2 123 456 789 000 多级列表 级别1 级别2 $f(x)=x^2+1$ 测试图标 🏷️ 测试mermaid 123456graph LR A[开始] --&gt; B(决策) B --&gt;|是| C(操作1) B --&gt;|否| D(操作2) C --&gt; E(结束) D --&gt; E 测试注释","link":"/posts/20240509_markdown_test/"},{"title":"openlane-v2 数据集介绍","text":"数据集主页/git仓库 论文 标注内容 输入 环视图像 SDmap 输出(即标注内容) 车道中心线 交通标志, 红绿灯和路边交通牌 车道中心线的拓扑 车道中心线和交通标志之间的对应关系 可视化见 OpenLane-V2/docs/annotation.md at master · OpenDriveLab/OpenLane-V2 似乎没有标道路边界? 标注格式 标注介绍 OpenLane-V2/data at master · OpenDriveLab/OpenLane-V2 traffic_element 有哪些属性 topology_lclc 代表啥 topology_lcte 代表啥 无关联的标志如何标注 倒计时如何标注? 评测指标 其他 openlane-v1和openlane-v2的差别","link":"/posts/20240703_openlane-v2/"},{"title":"用习惯替代自律, 用他律代替自律","text":"罗胖60秒有一期节目叫”怎样坚持一件长期的事”, 里面讲到一个人能罕见的坚持一件事情, 也许不是意志的胜利, 而是因为习惯的支撑。 罗胖自己就是这个道理的出色实践者。 罗胖做了十年的罗胖60秒, 每天日更, 更新了3652期罗胖要做二十年的跨年演讲,现在已经做完了九场。23年跨年夜, 我参加了罗胖跨年演讲的线下分会场, 当罗胖讲到, 他将用20年时间每周一期来讲述《文明》节目的时候，我先是无比震惊, 然后热泪盈眶，这需要多大的勇气才能立出这么大的flag, 好狠的一个人呐. 罗胖能做成这几件看似疯狂的事情, 背后可能有两个关键因素, 一个是习惯, 一个是他律。 习惯可以让行为变得自然, 就像飞轮一样, 越转越轻松. 罗胖这三个目标, 有一个非常显著的共同点, 就是要保证规律的产出, 保持规律就是形成习惯的基础。 另一方面, 罗胖是一个立flag的狠人, 当一个人公开的立一个flag, 他的行为就有了外部的约束和监督, 这便是他律, 相当于于获得了来自外部的力量, 看似是一个人在前行, 实际是一群人在前行, 一群人能走得更远。 习惯加他律，最终形成自律的表现, 实现看似不可能的目标。","link":"/posts/20240530_insistent/"},{"title":"多读传记的好处","text":"多读传记有一些好处: 可以提高我们的决策水平。 有一种解决问题的方法叫做“角色模型”思考法。面对难题时，我们可以问问自己：“如果换作xxx，他会如何应对？”通过读传记，我们可以充实这个的角色库，让这些传主成为我们的智囊团，帮助我们做出更明智的决策。 可以积累宝贵的人生经验。 我们在旅行前往往会查看大量攻略来保证未来旅程的顺利. 面对人生这个旅途，我们同样需要“攻略”。而传记就是一个个的人生攻略。正如古人所说，“太阳底下没有新鲜事”，通过读传记，我们可以积累更多经验, 进而少踩坑, 走更远。 可以拓宽我们的视野。 很多时候，我们之所以无法做到某些事情，是因为我们不相信这些事情是有可能的。例如，前段时间有个“专科生考入MIT”的故事, 刷新了很多人的认知. 这个故事让我不禁想，如果我在大学时就了解到这样的故事，我可能会为自己设定更高的学术目标。只要有一个人能做到, 那我是不是也能做到呢. 网上有一句很火的话, “你的水平, 是你最常接触的5个人的平均值”。这句话启示我们，接触更优秀的人能够提升自己的水平。现实生活中，我们很难与比自己优秀的人深入接触，但传记为我们提供了这样的机会。通过阅读传记，我们可以深入了解那些杰出人物的生活，观察他们的行为方式和决策过程。这是一种难得的学习机会，传记让我们能够与这些杰出人物建立一种精神上链接。总之, 多读传记可以让我们成为更好的自己.","link":"/posts/20240531_read_biography/"}],"tags":[{"name":"llm","slug":"llm","link":"/tags/llm/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"hugo","slug":"hugo","link":"/tags/hugo/"},{"name":"wordpress","slug":"wordpress","link":"/tags/wordpress/"},{"name":"自律","slug":"自律","link":"/tags/%E8%87%AA%E5%BE%8B/"},{"name":"习惯","slug":"习惯","link":"/tags/%E4%B9%A0%E6%83%AF/"},{"name":"读书","slug":"读书","link":"/tags/%E8%AF%BB%E4%B9%A6/"}],"categories":[{"name":"note","slug":"note","link":"/categories/note/"},{"name":"life","slug":"life","link":"/categories/life/"}],"pages":[]}